
// //==========================================================================================================================================================
/*      
       String format methode 삽입 
       "{0} 다음 {1}".format("첫번째","두번째")   =  "첫번째 다음 두번째" 

*/
// //==========================================================================================================================================================

String.prototype.format = function(...args){
    console.log(args)
    return this.replace(/{(\d+)}/g,function(match,number){
        return typeof args[number] != 'undefined' ? args[number]:match;
    });
};


